{
  "model_type": "zen-omni",
  "variant": "captioner",
  "architectures": ["ZenOmniForCausalLM"],
  "auto_map": {
    "AutoConfig": "configuration_zen_omni.ZenOmniConfig",
    "AutoModel": "modeling_zen_omni.ZenOmniModel",
    "AutoModelForCausalLM": "modeling_zen_omni.ZenOmniForCausalLM"
  },
  "model_config": {
    "total_params": 30000000000,
    "active_params": 3000000000,
    "num_experts": 10,
    "experts_per_token": 2,
    "hidden_size": 4096,
    "intermediate_size": 16384,
    "num_attention_heads": 32,
    "num_key_value_heads": 8,
    "num_hidden_layers": 48,
    "vocab_size": 100000,
    "max_position_embeddings": 24576,
    "rope_theta": 1000000,
    "rope_scaling": {
      "type": "linear",
      "factor": 1.8
    },
    "modalities": ["text", "image", "audio", "video"],
    "thinker_weight": 0.5,
    "talker_weight": 0.5,
    "thinker_layers": 24,
    "talker_layers": 24
  },
  "vision_config": {
    "image_size": 336,
    "patch_size": 14,
    "num_channels": 3,
    "hidden_size": 1024,
    "intermediate_size": 4096,
    "num_hidden_layers": 24,
    "num_attention_heads": 16,
    "dropout": 0.0,
    "attention_dropout": 0.0
  },
  "audio_config": {
    "sample_rate": 16000,
    "feature_size": 128,
    "hidden_size": 1024,
    "intermediate_size": 4096,
    "num_hidden_layers": 16,
    "num_attention_heads": 16,
    "window_size": 400,
    "hop_size": 160,
    "use_spectral_features": true
  },
  "video_config": {
    "frames_per_second": 30,
    "max_frames": 128,
    "frame_size": 224,
    "temporal_hidden_size": 1536,
    "temporal_layers": 8,
    "use_3d_conv": true,
    "temporal_attention": true,
    "cross_frame_attention": true
  },
  "captioning_config": {
    "max_caption_length": 256,
    "min_caption_length": 10,
    "use_beam_search": true,
    "num_beams": 3,
    "length_penalty": 0.8,
    "dense_captioning": true,
    "temporal_alignment": true,
    "segment_duration": 5.0,
    "overlap_duration": 1.0
  },
  "generation_config": {
    "temperature": 0.6,
    "top_p": 0.92,
    "top_k": 45,
    "repetition_penalty": 1.08,
    "do_sample": true,
    "max_new_tokens": 512,
    "pad_token_id": 0,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "use_cache": true
  },
  "torch_dtype": "float16",
  "transformers_version": "4.40.0",
  "license": "apache-2.0"
}